Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/bereavement_counselling_and_support/support_services_for_those_affected_by_suicide.html.txt.tmx
Source language: en
Languages: ga

source: Many people have a role to play in providing appropriate assistance within the first few hours following a death by suicide
ga: Tá páirt ghníomhach ag go leor daoine i gcúnamh cuí a sholáthar taobh istigh den chéad chúpla uair an chloig tar éis bháis a tharla de bharr féinmharaithe

source: These people include the Gardai, Coroners, health professionals and funeral directors
ga: Ina measc siúd tá na Gardaí, Cróinéirí, cleachtóirí leighis, stiúrthóirí sochraidí & rl

source: If you are, or have been bereaved by suicide you may experience a range of emotions including shock, disbelief, guilt and anger
ga: Má tá duine a bhain leat básaithe de bharr féinmharaithe d'fhéadfadh go leor mothúchán a theacht ort, ina measc geit, díchreideamh, ciontacht agus fearg

source: As suicide may occur unexpectedly or be very sudden, this makes it traumatic for those left behind (particuarly for family and friends)
ga: Tharla nach mbíonn aon tsúil go hiondúil le féinmharú agus go dtarlaíonn sé chomh tobann bíonn sé fíor-dheacair ar na daoine atá fágtha deileáil leis (go háirid do ghaolta agus cairde)

source: Even though this is an extremely difficult time, there are important practical and material matters that can and will arise after any death
ga: Cé gur am fíor dheacair é seo, tá ceisteanna tábhachtachta praiticiúla agus saolta a d'fhéadfadh agus is cinnte a thiocfaidh aníos tar éis an bháis

source: Information for the Bereaved has been specially written to help guide you through all the issues and all the stages
ga: Cuireadh eolas ar fáil go speisialta in Eolas do Mhuintir an Mharánaigh le treoir a thabhairt duit deileáil leis na ceisteanna agus leis na céimeanna ar fad

source: It contains information such as what to do immediately after a death, possible social welfare entitlements, tax, financial and legal issues that can and will arise
ga: Tá eolas ar fáil ann maidir lenár ceart a dhéanamh ar an bpointe tar éis bháis, liúntais leasa shóisialaigh a d’fhéadfadh sé go mbeadh ar fáil, cúrsaí cánach, ceisteanna airgeadais agus dlíthiúla a thiocfaidh aníos

source: This booklet also contains information about where to go for further information and support
ga: Tá eolas ar fáil sa leabhrán seo freisin cá bhfuil tuilleadh eolais agus tacaíocht ar fáil duit

source: It's important to be aware that there are a range of organisations throughout Ireland that can help if you have been bereaved through suicide or if you find yourself in a supporting role to someone who has been bereaved in this way
ga: Ba cheart a thuiscint go bhfuil go leor eagraíochtaí ar fud na hÉireann gur féidir leo cúnamh a thabhairt duit sa chás seo nó má tharlaíonn sé go bhfuil tú ag tabhairt tacaíochta do dhuine eile atá buailte go dona ag féinmharú

source: Each situation involving suicide is different and people react in different ways
ga: Ní mar a chéile aon dá chás agus ní mar a chéile a bhíonn aon bheirt ag deileáil leis an mbás seo

source: If you are in a supporting role it is important to be extremely sensitive to the needs of the bereaved person
ga: Má tá tú ag tabhairt tacaíochta do dhuine eile tá sé fior thábhachtach a bheith an-tuiscineach faoi riachtanais an té atá faoi bhrón a shásamh

source: It's also important to know that if you are in a supportive role, there may come a time when you find that you can no longer offer the level or standard of support that is needed
ga: Ba cheart go dtuigfeá freisin má tá tú ag cur tacaíochta ar fáil do dhuine go bhféadfadh an t-am a theacht nuair nach féidir leat an leibhéal céanna tacaíochta nó an cineál tacaíochta a theastaíonn a chur ar fáil

source: The following organisations can help
ga: Tá cúnamh ar fáil ó na heagraíochtaí seo a leanas

source: They will offer you advice, information and support during this very distressing time and can also help put you in touch with other people in your area that have been through this experience
ga: Cuirfidh siad comhairle ar fáil duitse, chomh maith le heolas agus tacaíocht ag an am úfásach seo agus beidh siad in ann cúnamh a thabhairt duit dul i dteagmháil le daoine eile i do cheantar ar tharla an rud céanna dóibh

source: National Office for Suicide Prevention
ga: An Oifig Náisiúnta um Fhéinmharú a Chosc

source: The National Office for Suicide Prevention (NOSP) was established within the Health Service Executive in 2005 to oversee the implementation of the first National Strategy for Action on Suicide Prevention (pdf)
ga: Bunaíodh an Oifig Náisiúnta um Fhéinmharú a Chosc (NOSP) laistigh d'Fheidhmeannacht na Seirbhíse Sláinte sa bhliain 2005 chun maoirseacht a dhéanamh ar an gcéad Straitéis Náisiúnta na hÉireann um Bheart le Féinmharú a Chosc (pdf)

source: NOSP supports the implementation of the current national strategy, Connecting for Life, and co-ordinates suicide prevention efforts around the country
ga: Tacaíonn NOSP le cur i bhfeidhm na straitéise náisiúnta atá ann faoi láthair, Nascadh don Saol, agus comhordaíonn hiarrachtaí um fhéinmharú a chosc ar fud na tíre

source: It also works closely with the Health Sevice Executive's Resource Officers for Suicide Prevention
ga: Oibríonn sé go dlúth freisin leis na hOifigigh Acmhainne um Fhéinmharú a Chosc de chuid Fheidhmeannacht na Seirbhíse Sláinte

source: There is a network of Suicide Prevention Resource Officers appointed in the Health Service Executive (HSE) across Ireland that provide information on local support services for those who have been bereaved through suicide
ga: Tá gréasán Féinmharaithe nOifigeach Chosc Acmhainne a ceapadh Fheidhmeannacht na Seirbhíse Sláinte (FSS) ar fud na hÉireann a sholáthraíonn faisnéis faoi sheirbhísí tacaíochta áitiúla do dóibh siúd a bhí ag fulaingt méala trí fhéinmharú

source: Information on other organisations providing bereavement support is available from the Child and Family Agency and on the HSE website
ga: Tá eolas ar eagraíochtaí eile a sholáthraíonn tacaíocht méala ar fáil ón nGníomhaireacht um Leanaí agus Teaghlaigh agus ar agus ar shuíomh gréasáin na FSS
